token='5567007874:AAFPGGxjX3l6IZS-rk_GT2zhmMsbSs9O3eI'

character_list=['Добрый','Наглый','Молчаливый','Неудачник','Безынициативные','Параноик','Весёлый','Застенчивый',
                'Культурный','Трудолюбивый','Гуманный','Самостоятельный','Ленивый','Душный','Спокойный','Глупый',
                'Грубиян','Скупой','Прокрастинатор','Перфекционист']

age_list=['Мужчина 93 года','Мужчина 76 года','Мужчина 70 лет','Мужчина 44 года','Мужчина 41 год Чайлдфри',
          'Мужчина 36 лет','Мужчина 29 год','Мужчина 22 года Чайлдфри','Мужчина 17 лет','Мужчина 14 лет',
          'Женщина 101 год Чайлдфри','Женщина 84 года','Женщина 62 года Чайлдфри','Женщина 50 лет',
          'Женщина 35 лет','Женщина 28 лет','Женщина 27 лет Чайлдфри','Женщина 22 года','Женщина 20 лет','Женщина 12 лет']

options_list=['146 см. Сильное Ожирение','148 см. Крепкое','151 см. Среднее','150 см. Полное','150 см. Полное'
              '151 см. Среднее','150 см. Полное','155 см. Ожирение','159 см. Хрупкое','161 см. Хрупкое','161 см. Крепкое',
              '165 см. Среднее','167 см. Полное','168 см. Хрупкое','170 см. Крепкое','173 см. Лёгкое Ожирение',
              '174 см. Среднее','182 см. Крепкое','189 см. Хрупкое','194 см. Полное','197 см. Среднее','202 см. Хрупкое',
              '230 см. Ожирение']

health_list=['Катаракта','Травма руки','Инсульт','Идеально здоров','Идеально здоров','Идеально здоров',
              'Идеально здоров','Эбола','Короновирус','Рак','Рак','Простуда','Кашель','Аллергия на пыль',
              'Биполярное растройство','Синдром туретта','Психопатия','Гетерохромия','Бессоница','Геморрой']

hobby_list=['Дзюдо', 'Садоводство', 'Автомобили', 'Туристические походы', 'Силовые тренировки',
            'Дайвинг', 'Музыка', 'Викторины', 'Картография', 'Коллекционирование карт', 'Блоггерство',
            'Скейтборд', 'Изготовление самодельных вещей', 'Охота', 'Аэробика', 'Уход за собой',
            'Волейбол', 'Изготовление кукол', 'Теннис', 'Сноуборд']

phobias_list=['Боязнь мифов', 'Боязнь толпы', 'Боязнь молока', 'Боязнь воды',
              'Боязнь огня', 'Боязнь высота', 'Клаустрофобия', 'Боязнь одиночества',
              'Боязнь сна', 'Боязнь инвалидов', 'Боязнь ошибок', 'Боязнь НЛО', 'Боязнь компьютеров',
              'Боязнь кротов', 'Боязнь оленей', 'Боязнь женщин', 'Боязнь полных людей', 'Боязнь цветов',
              'Боязнь книг', 'Боязнь ковров']

things_list= ['5 кг. Консерв', '10 кг. Клюквы', '3 кг. Мяса', '7 кг. Хлеба',
              'Стопка комиксов', 'Корова', 'Протез руки', 'Мыло (7', 'шт.)', 'Коктейль Молотова',
              'АК-47', 'Семена Пшеницы', 'Свеча', 'Тетрадь и ручка', 'Сажены подсолнуха',
              'Лак для волос', 'Термосумка', 'Яйцо дракона', 'Антисептик', 'Радио', 'Котёнок']

achievements_list=['Знает 5 языков', 'Убил Арлабуса', 'Родила 20 детей',
                   'Верит в Клюкву', 'Снимался в Матрице', 'Биолог по образованию',
                   'Скептик', 'Частая отрыжка', 'Работал строителем', 'Веган', 'Владеет гипнозом',
                   'Баскетболист', 'Писатель в прошлом', 'Верит в НЛО', 'Проходил курсы рисования',
                   'Победил Рак', 'Снял 30 роликов по МШ2', 'Заикается', 'Смотрит аниме',
                   'Играет в КС']

proffecional_list=['Фармацевт', 'Ученый', 'Уборщик', 'Судья', 'Строитель', 'Психолог', 'Прораб', 'Посол',
                   'Майор', 'Логопед', 'Культуролог', 'Историк', 'Вор', 'Бездельник', 'Артист',
                   'Актер озвучки', 'Абитуриент', 'Генетик', 'Диетолог', 'Доярка']
condition_list=['Добавить любому игроку дополнительную фобию',
          'Около вашего бункера находится другой вражеский бункер',
          'Сгенерировать себе новую специальность',
          'Перегенерировать характеристику “Здоровье” любого игрока',
          'Раскрыть любую характеристику любого игрока',
          'Исправить проблемы в бункере (водоснабжение, запах и т.д.)',
          'Возможность поменяться характеристикой "Фобия" с другим игроком',
          'Перегенерировать бункер',
          'Украсть состояние здоровья у другого игрока. Тот, у кого украли состояние здоровья генерирует себе новое',
          'Около вашего бункера есть бункер с 2-мя женщинами',
          'Удалить спец возможности профессий всех игроков',
          'Рядом с вашим бункером находится вражеский бункер. Они будут на вас нападать',
          'Поменять свою характеристику "Специальность" на новую,',
          'У вас есть информация о том, где находится склад с продуктами.',
          'Разделить бункер на двухместные комнаты',
          'Отменить следующую используемую спец. возможность',
          'Защитить всех открытых мужчин от кика на 1 ход',
          'Защитить всех открытых женщин от кика на 1 ход',
          'Ваш бункер находится около парка развлечений',
          'Украсть корову у доярки, без коровы она теряет специальность']

story_list=['''Ученые-астрономы спрогнозировали столкновение с крупной кометой. 
Это произошло… Планета сошла со своей орбиты. 
Из-за резких перепадов давления на всей поверхности Земли появились огромные смерчи, 
которые сметают все на своем пути. Разрушения колоссальны: рушатся поселения, 
леса повалены, по всему миру начались наводнения, 
большие части суши сносит водой и уносит в океан. 
Люди бегут из городов в поисках убежища.
Остаток населения - ≈65 420 721 человек''',
            '''С планетой происходит что-то неизвестное. 
С каждым днем появляется все больше и больше торнадо огромных размеров, 
которых раньше люди и не видели. Ураганы разрушают все, 
что только попадается на их пути и не теряют свою силу. 
Их количество настолько огромное, что люди не успевают уехать в более безопасное место. 
На планете вымирает все живое, разрушаются помещения, поля, растения. 
Жизнь на поверхности становится невозможна. 
Никто не знает когда это закончится и чего стоит ждать дальше. 
Вероятно, существование человечества будет возможно только под землей, 
а выход на поверхность будет доступен лишь на несколько минут...
Остаток населения - ≈5 749 937 человек''','''Несколько месяцев назад средь бела дня произошла необычная фиолетовая вспышка на солнце. 
В дальнейшем так и не удалось выявить причины этой вспышки, 
за что человечество поплатилось многими жизнями и не только… 
Оказалось, что вспышка вызвала эволюцию невиданной скорости всех растений на земле, 
до которых могли дотянуться солнечные лучи. 
Цветы, деревья, овощи, да и все «зелёные» увеличились в разы в размерах, 
обрели интеллект и возможность медленно, но уверенно, перемещаться по земле, 
вследствие чего было убито множество людей и животных. 
В то же время были атакованы оборонительные комплексы, 
в том числе, ядерные станции и шахты. Кто бы мог такое представить, 
что «еда» взбунтуется… На данный момент нет возможности противостоять этим атакам, 
поэтому стоит затаиться и придумать способ победить.
Остаток населения - ≈58 697 639 человек''','''Астрономы засекли метеорит. 
На траектории его движения находится родная планета Земля. 
Столкновения уже не избежать. 
Люди запаниковали и группами начали искать бункеры, чтобы спастись. 
Страх, что метеорит огромных размеров упадет на планету, 
а его взрывная волна обогнет Землю два раза приводит всех в оцепенение. 
Огромные территории на поверхности Земли охватят пожары, кислород будет на исходе. 
Миллионы людей сгорят заживо в лесных пожарах, ведь лишь в бункере возможно выжить.
Остаток населения - ≈38 413 151 человек''']

bunker_list=['''Бункер
Построен давно. Имеются проблемы с электричеством, 
находится недалеко от электростанции, у всех выживших общая комната
Размер бункера: 80кв.м
Время нахождения: 4 года
Количество еды: на год и 6 месяцев
В бункере присутствует:
- Компьютер
- Надувная лодка
- Биотуалет''','''Бункер
Был построен когда началась эта катастрофа, 
находится среди шахт, у всех выживших индивидуальные комнаты
Размер бункера: 110кв.м
Время нахождения: 1 год
Количество еды: на 9 месяцев
В бункере присутствует:
- Учебные пособия для изучения иностранных языков
- Все необходимое для ловли рыбы, включая лодки
- Респираторная маска (2 шт.)''','''Бункер
Был построен 8 лет назад, находится в пещере, у всех выживших индивидуальные комнаты
Размер бункера: 160кв.м
Время нахождения: 1 год 3 месяца
Количество еды: на год и 6 месяцев
В бункере присутствует:
- Семена зерновых для посадки и оборудованная теплица
- Станок для резки металла
- Изолятор''','''Бункер
Был построен когда началась эта катастрофа, находится на горе, 
у всех выживших индивидуальные комнаты
Размер бункера: 80кв.м
Время нахождения: 1 год 6 месяцев
Количество еды: на год
В бункере присутствует:
- Склад с медикаментами
- Холодильник (с едой на 1 месяц)
- Бильярдная''']







